emacs/.doom.d/cheatsheet.org
#+title: Doomemacs Cheatsheet
#+OPTIONS: toc:nil num:nil
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="cheatsheet.css" />

* Open files
|----------------------------+-----------|
| Recently opened files      | [[kbd:][SPC f r]]   |
| Reload last session        | [[kbd:][SPC q l]]   |
| Open org-agenda            | [[kbd:][SPC o A]]   |
| Open project               | [[kbd:][SPC p p]]   |
| Jump to bookmark           | [[kbd:][SPC RET]]   |
| Open private configuration | [[kbd:][SPC f P]]   |
| Open documentation         | [[kbd:][SPC h d h]] |
|----------------------------+-----------|

* Jump to files, buffers or projects
|------------------+---------------------------------------|
| [[kbd:][SPC RET]]          | Find bookmark                         |
| [[kbd:][SPC f f]], [[kbd:][SPC .]]   | Browse from current directory         |
| [[kbd:][SPC p f]], [[kbd:][SPC SPC]] | Find file in project                  |
| [[kbd:][SPC f r]]          | Find recently opened file             |
| [[kbd:][SPC p p]]          | Open another project                  |
| [[kbd:][SPC b b]], [[kbd:][SPC ,]]   | Switch to buffer in current workspace |
| [[kbd:][SPC b B]], [[kbd:][SPC <]]   | Switch to buffer                      |
|------------------+---------------------------------------|

* Code completion
|---------+------------------------------------------|
| [[kbd:][C-n]]     | Go to next candidate                     |
| [[kbd:][C-p]]     | Go to previous candidate                 |
| [[kbd:][C-j]]     | (evil) Go to next candidate              |
| [[kbd:][C-k]]     | (evil) Go to previous candidate          |
| [[kbd:][C-h]]     | Display documentation (if available)     |
| [[kbd:][C-u]]     | Move to previous page of candidates      |
| [[kbd:][C-d]]     | Move to next page of candidates          |
| [[kbd:][C-s]]     | Filter candidates                        |
| [[kbd:][C-S-s]]   | Search candidates with helm/ivy          |
| [[kbd:][C-SPC]]   | Complete common                          |
| [[kbd:][TAB]]     | Complete common or select next candidate |
| [[kbd:][S-TAB]]   | Select previous candidate                |
|---------+------------------------------------------|

* Jump-to navigation
|------------------+-------------------------------------|
| [[kbd:][SPC p f]], [[kbd:][SPC SPC]] | Jump to file in project             |
| [[kbd:][SPC f f]], [[kbd:][SPC .]]   | Jump to file from current directory |
| [[kbd:][SPC s i]]          | Jump to symbol in file              |
|------------------+-------------------------------------|
