emacs/.doom.d/cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-20 Sat 00:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doomemacs Cheatsheet</title>
<meta name="author" content="Gunnar Bastkowski" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="cheatsheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Doomemacs Cheatsheet</h1>
<div id="outline-container-org28609d8" class="outline-2">
<h2 id="org28609d8">Open files</h2>
<div class="outline-text-2" id="text-org28609d8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Recently opened files</td>
<td class="org-left"><a href="kbd:">SPC f r</a></td>
</tr>

<tr>
<td class="org-left">Reload last session</td>
<td class="org-left"><a href="kbd:">SPC q l</a></td>
</tr>

<tr>
<td class="org-left">Open org-agenda</td>
<td class="org-left"><a href="kbd:">SPC o A</a></td>
</tr>

<tr>
<td class="org-left">Open project</td>
<td class="org-left"><a href="kbd:">SPC p p</a></td>
</tr>

<tr>
<td class="org-left">Jump to bookmark</td>
<td class="org-left"><a href="kbd:">SPC RET</a></td>
</tr>

<tr>
<td class="org-left">Open private configuration</td>
<td class="org-left"><a href="kbd:">SPC f P</a></td>
</tr>

<tr>
<td class="org-left">Open documentation</td>
<td class="org-left"><a href="kbd:">SPC h d h</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9300afd" class="outline-2">
<h2 id="org9300afd">Jump to files, buffers or projects</h2>
<div class="outline-text-2" id="text-org9300afd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Find bookmark</td>
<td class="org-left"><a href="kbd:">SPC RET</a></td>
</tr>

<tr>
<td class="org-left">Browse from current directory</td>
<td class="org-left"><a href="kbd:">SPC f f</a>, <a href="kbd:">SPC .</a></td>
</tr>

<tr>
<td class="org-left">Find file in project</td>
<td class="org-left"><a href="kbd:">SPC p f</a>, <a href="kbd:">SPC SPC</a></td>
</tr>

<tr>
<td class="org-left">Find recently opened file</td>
<td class="org-left"><a href="kbd:">SPC f r</a></td>
</tr>

<tr>
<td class="org-left">Open another project</td>
<td class="org-left"><a href="kbd:">SPC p p</a></td>
</tr>

<tr>
<td class="org-left">Switch to buffer in current workspace</td>
<td class="org-left"><a href="kbd:">SPC b b</a>, <a href="kbd:">SPC ,</a></td>
</tr>

<tr>
<td class="org-left">Switch to buffer</td>
<td class="org-left"><a href="kbd:">SPC b B</a>, <a href="kbd:">SPC &lt;</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org068aab4" class="outline-2">
<h2 id="org068aab4">Code completion</h2>
<div class="outline-text-2" id="text-org068aab4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Go to next candidate</td>
<td class="org-left"><a href="kbd:">C-n</a></td>
</tr>

<tr>
<td class="org-left">Go to previous candidate</td>
<td class="org-left"><a href="kbd:">C-p</a></td>
</tr>

<tr>
<td class="org-left">(evil) Go to next candidate</td>
<td class="org-left"><a href="kbd:">C-j</a></td>
</tr>

<tr>
<td class="org-left">(evil) Go to previous candidate</td>
<td class="org-left"><a href="kbd:">C-k</a></td>
</tr>

<tr>
<td class="org-left">Display documentation (if available)</td>
<td class="org-left"><a href="kbd:">C-h</a></td>
</tr>

<tr>
<td class="org-left">Move to previous page of candidates</td>
<td class="org-left"><a href="kbd:">C-u</a></td>
</tr>

<tr>
<td class="org-left">Move to next page of candidates</td>
<td class="org-left"><a href="kbd:">C-d</a></td>
</tr>

<tr>
<td class="org-left">Filter candidates</td>
<td class="org-left"><a href="kbd:">C-s</a></td>
</tr>

<tr>
<td class="org-left">Search candidates with helm/ivy</td>
<td class="org-left"><a href="kbd:">C-S-s</a></td>
</tr>

<tr>
<td class="org-left">Complete common</td>
<td class="org-left"><a href="kbd:">C-SPC</a></td>
</tr>

<tr>
<td class="org-left">Complete common or select next candidate</td>
<td class="org-left"><a href="kbd:">TAB</a></td>
</tr>

<tr>
<td class="org-left">Select previous candidate</td>
<td class="org-left"><a href="kbd:">S-TAB</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org97210ce" class="outline-2">
<h2 id="org97210ce">Jump-to navigation</h2>
<div class="outline-text-2" id="text-org97210ce">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Jump to file in project</td>
<td class="org-left"><a href="kbd:">SPC p f</a>, <a href="kbd:">SPC SPC</a></td>
</tr>

<tr>
<td class="org-left">Jump to file from current directory</td>
<td class="org-left"><a href="kbd:">SPC f f</a>, <a href="kbd:">SPC .</a></td>
</tr>

<tr>
<td class="org-left">Jump to symbol in file</td>
<td class="org-left"><a href="kbd:">SPC s i</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gunnar Bastkowski</p>
<p class="date">Created: 2024-07-20 Sat 00:49</p>
</div>
</body>
</html>
